      *> Témoins état curseur Db2                                       AAA0LS20
       01               W-:DD:00-CESBCU  PIC X VALUE 'C'.               AAA0LS20
                    88  :DD:-OUVERT            VALUE 'O'                AAA0LS20
                                             FALSE 'C'.                 AAA0LS20
