      *--- Interface VSAM ----------------------------------------------AAADVSTA
      * File status VSAM                                                AAADVSTA
       01                 VSAM-STATUS.                                  AAADVSTA
           02             VSAM-RCODE   PIC  9(2) COMP-5 VALUE ZERO.     AAADVSTA
           02             VSAM-FCODE   PIC  9(1) COMP-5 VALUE ZERO.     AAADVSTA
           02             VSAM-FBCODE  PIC  9(3) COMP-5 VALUE ZERO.     AAADVSTA
